config.org
#+TITLE: Emacs Config
#+AUTHOR: Ralph Dreijer
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* General setup
** Performance
*** Garbage collection tweaks
#+begin_src emacs-lisp :tangle ./early-init.el
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.5)
  (add-hook 'emacs-startup-hook
  	  (lambda () (setq gc-cons-threshold 800000)))
#+end_src

*** Report startup time
#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
  	  (lambda ()
  	    (message "Emacs loaded in %.2f seconds"
  		     (float-time
  		      (time-subtract after-init-time before-init-time)))))
#+end_src
** Package management
*** straight.el
Bootstrap code:
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

Prevent =package.el= from loading:
#+begin_src emacs-lisp :tangle ./early-init.el
(setq package-enable-at-startup nil)
#+end_src
*** use-package
#+begin_src emacs-lisp
  (straight-use-package 'use-package)
  (setq use-package-compute-statistics t)
#+end_src

For =:ensure-system-package=
#+begin_src emacs-lisp
  (use-package system-packages :straight t)
  (use-package use-package-ensure-system-package)
#+end_src

** Keep folders clean
*** Disable backup files
#+begin_src emacs-lisp
(setopt make-backup-files nil)
#+end_src

*** _Helper function:_ =expand-file-name= for cache files
#+begin_src emacs-lisp
  (defun expand-file-name-cache (file-name)
    (let* ((cache-dir (expand-file-name ".cache" user-emacs-directory))
  	 (file-path (expand-file-name file-name cache-dir))
  	 (file-dir (file-name-directory file-path)))
      (make-directory file-dir t) file-path))
#+end_src

** COMMENT Load scripts 
Add scripts folder to load path:
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/scripts/")
#+end_src

Source scripts:
#+begin_src emacs-lisp
(require 'buffer-move)
(require 'multi-term)
#+end_src

** Set custom file
#+begin_src emacs-lisp
(setq custom-file (concat user-emacs-directory "custom.el"))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

** Setup recent files
#+begin_src emacs-lisp
  (setopt recentf-save-file (expand-file-name-cache "recentf.el"))
  (recentf-mode)
#+end_src
* Helper functions
** xdg-open
+ Runs =xdg-open [path]=
+ Tries to get =[path]= from current buffer if not specified

#+begin_src emacs-lisp
  (defun xdg-open (&optional path)
    "Run xdg-open on PATH (if not specified: current buffer file).
  With \\[universal-argument] prefix: open the directory instead."
    (interactive)
    (-if-let (path (or path (ignore-errors
  			    (expand-file-name
  			     (pcase major-mode
  			       ('dired-mode dired-directory)
    			       (_ buffer-file-name))))))
        (let ((target (if current-prefix-arg
    			(file-name-directory path)
    		      path))
    	    (process-connection-type nil))
    	(start-process "" nil "xdg-open" target))
      (message "Nothing to open here.")))
#+end_src

** get-title-from-url
#+begin_src emacs-lisp
  (defun get-title-from-url (url)
    "Make HTTP request to get title from URL"
    (with-current-buffer (url-retrieve-synchronously url)
      (goto-char (point-min))
      (re-search-forward "\n\n") ;; Skip HTTP headers
      (let ((dom (libxml-parse-html-region (point) (point-max))))
        (dom-text (car (dom-by-tag dom 'title)))
        )))
#+end_src

** COMMENT SSH stuff
Get hosts from ssh config file:
#+begin_src emacs-lisp
  (defun parse-ssh-config-hosts (ssh-config-file)
    "Parse the SSH config file and return a list of hosts."
    (let ((hosts '()))
      (when (file-readable-p ssh-config-file)
        (with-temp-buffer
          (insert-file-contents ssh-config-file)
          (goto-char (point-min))
          (while (re-search-forward "^Host[ \t]+\\(.*\\)$" nil t)
            (let ((host-line (match-string 1)))
              (dolist (host (split-string host-line))
                (unless (string-match-p "[*?]" host) ;; Ignore wildcards
                  (push host hosts)))))))
      (delete-dups hosts)))
#+end_src

Make an ivy menu for it:
#+begin_src emacs-lisp
  (defun ivy-ssh-config-hosts ()
    "Return a selected SSH host from the SSH config file using Ivy."
    (let* ((ssh-config-file (expand-file-name "~/.ssh/config"))
           (hosts (parse-ssh-config-hosts ssh-config-file)))
      (if hosts
          (ivy-read "SSH Hosts: " hosts)
        (user-error "No hosts found in %s" ssh-config-file))))
#+end_src

*** SSH find file
#+begin_src emacs-lisp
  (defun find-file-ssh ()
    "Open a file on a remote SSH host."
    (interactive)
    (let* ((host (ivy-ssh-config-hosts))
           (default-directory (concat "/ssh:" host ":")))
      (call-interactively #'counsel-find-file)))
#+end_src

*** SSH Terminal
#+begin_src emacs-lisp
  (defun ssh-multi-term ()
    (interactive)
    (let* (
           (host (ivy-ssh-config-hosts))
           (multi-term-program "/bin/sh")
           (multi-term-buffer-name (format "SSH: %s" host))
           (term-cmd (format "ssh %s\n" host))
           (term-buffer (multi-term))
           )
      (term-send-raw-string term-cmd)
      ))
#+end_src

* Theme, UI
** Dracula theme
#+begin_src emacs-lisp
  (use-package dracula-theme
    :straight t
    :config
    (load-theme 'dracula t)
    )
#+end_src

** Diminish
Don't show all minor modes in the mode line:
#+begin_src emacs-lisp
  (use-package diminish :straight t)
#+end_src

** Ivy, Counsel
*** Ivy
[[https://github.com/abo-abo/swiper][GitHub - abo-abo/swiper: Ivy - a generic completion frontend for Emacs, Swiper - isearch with an overview, and more. Oh, man! · GitHub]]
#+begin_src emacs-lisp
  (use-package ivy
    :straight t
    :diminish
    :custom
    (ivy-count-format "(%d/%d) ")
    (enable-recursive-minibuffers t)
    :config
    (ivy-mode))
#+end_src

*** Counsel
#+begin_src emacs-lisp
  (use-package counsel
    :straight t
    :after ivy
    :diminish
    :custom
        (ivy-initial-inputs-alist nil)
    :config 
      (counsel-mode))
#+end_src

*** Ivy-rich
[[https://github.com/Yevgnen/ivy-rich][GitHub - Yevgnen/ivy-rich: More friendly interface for ivy. · GitHub]]
#+begin_src emacs-lisp
  (use-package ivy-rich
    :straight t
    :after (ivy counsel)
    :config
    (ivy-rich-mode 1)
    )
#+end_src

** Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :straight t
    :defer t
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
  	    treemacs-deferred-git-apply-delay        0.5
  	    treemacs-directory-name-transformer      #'identity
  	    treemacs-display-in-side-window          t
  	    treemacs-eldoc-display                   'simple
  	    treemacs-file-event-delay                2000
  	    treemacs-file-extension-regex            treemacs-last-period-regex-value
  	    treemacs-file-follow-delay               0.2
  	    treemacs-file-name-transformer           #'identity
  	    treemacs-follow-after-init               t
  	    treemacs-expand-after-init               t
  	    treemacs-find-workspace-method           'find-for-file-or-pick-first
  	    treemacs-git-command-pipe                ""
  	    treemacs-goto-tag-strategy               'refetch-index
  	    treemacs-header-scroll-indicators        '(nil . "^^^^^^")
  	    treemacs-hide-dot-git-directory          t
  	    treemacs-indentation                     2
  	    treemacs-indentation-string              " "
  	    treemacs-is-never-other-window           t
  	    treemacs-max-git-entries                 5000
  	    treemacs-missing-project-action          'ask
  	    treemacs-move-files-by-mouse-dragging    t
  	    treemacs-move-forward-on-expand          nil
  	    treemacs-no-png-images                   nil
  	    treemacs-no-delete-other-windows         t
  	    treemacs-project-follow-cleanup          nil
  	    treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
  	    treemacs-position                        'left
  	    treemacs-read-string-input               'from-child-frame
  	    treemacs-recenter-distance               0.1
  	    treemacs-recenter-after-file-follow      nil
  	    treemacs-recenter-after-tag-follow       nil
  	    treemacs-recenter-after-project-jump     'always
  	    treemacs-recenter-after-project-expand   'on-distance
  	    treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
  	    treemacs-project-follow-into-home        nil
  	    treemacs-show-cursor                     nil
  	    treemacs-show-hidden-files               t
  	    treemacs-silent-filewatch                nil
  	    treemacs-silent-refresh                  nil
  	    treemacs-sorting                         'alphabetic-asc
  	    treemacs-select-when-already-in-treemacs 'move-back
  	    treemacs-space-between-root-nodes        t
  	    treemacs-tag-follow-cleanup              t
  	    treemacs-tag-follow-delay                1.5
  	    treemacs-text-scale                      nil
  	    treemacs-user-mode-line-format           nil
  	    treemacs-user-header-line-format         nil
  	    treemacs-wide-toggle-width               70
  	    treemacs-width                           35
  	    treemacs-width-increment                 1
  	    treemacs-width-is-initially-locked       t
  	    treemacs-workspace-switch-cleanup        nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
  	(treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
  		   (not (null treemacs-python-executable)))
  	(`(t . t)
  	 (treemacs-git-mode 'deferred))
  	(`(t . _)
  	 (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode -1))
    :bind
    (:map global-map
  	  ("C-/"       . treemacs-select-window)
  	  ;; ("C-x t 1"   . treemacs-delete-other-windows)
  	  ("<f1>"   . treemacs)
  	  ;; ("C-x t d"   . treemacs-select-directory)
  	  ;; ("C-x t B"   . treemacs-bookmark)
  	  ;; ("C-x t C-t" . treemacs-find-file)
  	  ;; ("C-x t M-t" . treemacs-find-tag)
  	  ))

  (use-package treemacs-evil
    :after (treemacs evil)
    :straight t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :straight t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :straight t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :straight t)

  ;; (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  ;;   :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  ;;   :straight t
  ;;   :config (treemacs-set-scope-type 'Perspectives))

  ;; (use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
  ;;   :after (treemacs)
  ;;   :straight t
  ;;   :config (treemacs-set-scope-type 'Tabs))

  (treemacs-start-on-boot)
#+end_src

** Line numbering
Prevent jumps:
#+begin_src emacs-lisp
  (setopt display-line-numbers-width-start t)
#+end_src

Select numbering depending on if =visual-line-mode= is active:
#+begin_src emacs-lisp
  (defun enable-line-numbering ()
    (interactive)
    (if visual-line-mode
        (let ((display-line-numbers-type 'visual))
  	(display-line-numbers-mode))
        (let ((display-line-numbers-type 'relative))
  	(display-line-numbers-mode))))
#+end_src

Add hooks:
#+begin_src emacs-lisp
  (add-hook 'text-mode-hook 'enable-line-numbering)
  (add-hook 'prog-mode-hook 'enable-line-numbering)
  (add-hook 'visual-line-mode-hook 'enable-line-numbering)
#+end_src

** Misc. UI tweaks
*** =early-init.el=
#+begin_src emacs-lisp :tangle ./early-init.el
  (scroll-bar-mode -1) ;; Hide scrollbar
  (tool-bar-mode -1) ;; Hide toolbar
  (menu-bar-mode -1) ;; Hide menubar

  (setq inhibit-startup-screen t) ;; Disable startup screen
  (add-to-list 'default-frame-alist '(fullscreen . maximized)) ;; Maximize frames by default
#+end_src
*** =init.el=
#+begin_src emacs-lisp
  (setopt use-short-answers t) ;; use y/n in prompts instead of typing out yes/no
  (setq initial-scratch-message "") ;; Make scratch buffer empty by default
#+end_src

* Keybindings, snippets, completion
** Keybindings
*** Evil mode
**** evil
#+begin_src emacs-lisp
  (use-package evil
    :straight t
    :init
    ;; Needed for evil-collection (see below):
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    :custom
    (evil-undo-system 'undo-redo)
    (evil-want-fine-undo t)
    (evil-lookup-func 'counsel-describe-symbol)
    (evil-respect-visual-line-mode t)
    :config
    (setopt evil-want-Y-yank-to-eol t)
    (evil-mode 1))
#+end_src

**** evil-collection
#+begin_src emacs-lisp
  (use-package evil-collection
    :straight t
    :diminish evil-collection-unimpaired-mode
    :after evil
    :config
    (evil-collection-init)
    )
#+end_src

**** evil-commentary
#+begin_src emacs-lisp
  (use-package evil-commentary
    :straight t
    :diminish
    :after evil
    :config
    (evil-commentary-mode)
    )
#+end_src

**** evil-goggles
Gives visual feedback
#+begin_src emacs-lisp
  (use-package evil-goggles
    :straight t
    :diminish
    :config
    (evil-goggles-mode)

    ;; optionally use diff-mode's faces; as a result, deleted text
    ;; will be highlighed with `diff-removed` face which is typically
    ;; some red color (as defined by the color theme)
    ;; other faces such as `diff-added` will be used for other actions
    (evil-goggles-use-diff-faces)

    ;; this variable affects "blocking" hints, for example when deleting - the hint is displayed,
    ;; the deletion is delayed (blocked) until the hint disappers, then the hint is removed and the
    ;; deletion executed; it makes sense to have this duration short
    (setq evil-goggles-blocking-duration 0.100) ;; default is nil, i.e. use `evil-goggles-duration'

    ;; this variable affects "async" hints, for example when indenting - the indentation
    ;; is performed with the hint visible, i.e. the hint is displayed, the action (indent) is
    ;; executed (asynchronous), then the hint is removed, highlighting the result of the indentation
    (setq evil-goggles-async-duration 0.300) ;; default is nil, i.e. use `evil-goggles-duration'
    )
#+end_src

